cfd/cases/leg_V1_closed/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     overPimpleDyMFoam;
libs            ("liboverset.so" "libfvMotionSolvers.so");

startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         2.6700;
deltaT          0.0013;
writeControl    adjustableRunTime;
writeInterval   0.04450;
purgeWrite      0;
writeFormat     binary;
writePrecision  8;
writeCompression on;
timeFormat      general;
timePrecision   7;
runTimeModifiable true;
adjustTimeStep  yes;
maxCo           0.8;
maxDeltaT       0.0052;

functions
{
    forces                    // 整条腿（桨 + 连杆段）的总力
    {
        type            forces;
        libs            ("libforces.so");
        patches         (paddle);
        rho             rhoInf;
        rhoInf          998.8;
        CofR            (0.0634 0 0.0040);     // 力矩参考点 = O2 髋轴
        writeControl    timeStep;
        writeInterval   1;
        log             false;
    }
    vorticity1
    {
        type            vorticity;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
    }
}
